Public Attributes | List of all members
API_AnalyticalLink_Translation Struct Reference
Analytical Model
Describe the translation of an analitycal link. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalRigidityType  | kxType
Rigidity type in X direction.
double  | kxValue
Rigidity value in X direction.
API_AnalyticalRigidityType  | kyType
Rigidity type in Y direction.
double  | kyValue
Rigidity value in Y direction.
API_AnalyticalRigidityType  | kzType
Rigidity type in Z direction.
double  | kzValue
Rigidity value in Z direction.
bool  | resistanceFx
Resistance value along the X axis.
bool  | resistanceFy
Resistance value along the Y axis.
bool  | resistanceFz
Resistance value along the Z axis.
double  | fxValue
Rotation value in X direction.
double  | fyValue
Rotation value in Y direction.
double  | fzValue
Rotation value in Z direction.
Detailed Description
Describe the translation of an analitycal link.
Since
Archicad 25
Member Data Documentation
◆ fxValue
 API_AnalyticalLink_Translation::fxValue
Rotation value in X direction.
◆ fyValue
 API_AnalyticalLink_Translation::fyValue
Rotation value in Y direction.
◆ fzValue
 API_AnalyticalLink_Translation::fzValue
Rotation value in Z direction.
◆ kxType
 API_AnalyticalLink_Translation::kxType
Rigidity type in X direction.
◆ kxValue
 API_AnalyticalLink_Translation::kxValue
Rigidity value in X direction.
◆ kyType
 API_AnalyticalLink_Translation::kyType
Rigidity type in Y direction.
◆ kyValue
 API_AnalyticalLink_Translation::kyValue
Rigidity value in Y direction.
◆ kzType
 API_AnalyticalLink_Translation::kzType
Rigidity type in Z direction.
◆ kzValue
 API_AnalyticalLink_Translation::kzValue
Rigidity value in Z direction.
◆ resistanceFx
 API_AnalyticalLink_Translation::resistanceFx
Resistance value along the X axis.
◆ resistanceFy
 API_AnalyticalLink_Translation::resistanceFy
Resistance value along the Y axis.
◆ resistanceFz
 API_AnalyticalLink_Translation::resistanceFz
Resistance value along the Z axis.